# Pandas 라이브러리 기초

In [1]:
# 라이브러리 선언
import pandas as pd

In [2]:
qtyList = [10, 15, 20, 13, 22]

In [3]:
pd.DataFrame(qtyList)

    0
0  10
1  15
2  20
3  13
4  22

In [4]:
# 데이터프레임에 이름 붙이기
qtyDf = pd.DataFrame(qtyList)

In [5]:
# 컬럼명 붙이기
qtyDf.columns = ["qty"]

In [6]:
qtyDf

   qty
0   10
1   15
2   20
3   13
4   22

In [7]:
# 데이터 프레임 생성과 동시에 컬럼명 지정
qtyDf = pd.DataFrame(qtyList, columns = ["qty2"])

### zip 활용 : 좌우로 병합

In [8]:
yearweekList = [202001, 202002, 202003, 202004, 202005]
qtyList = [10, 15, 20, 13, 22]

In [9]:
# zip이라는 함수로 두 리스트를 좌우로 묶어서 데이터 프레임 생성
# 각 연주차별로 qty를 볼 수 있다
pd.DataFrame( zip(yearweekList, qtyList) )

        0   1
0  202001  10
1  202002  15
2  202003  20
3  202004  13
4  202005  22

In [10]:
# 데이터 프레임 생성과 동시에 컬럼명 지정 가능
pd.DataFrame( zip(yearweekList, qtyList),
             columns = ["yearweek", "qty"])

   yearweek  qty
0    202001   10
1    202002   15
2    202003   20
3    202004   13
4    202005   22

### concat 활용 : 좌우로 병합

In [11]:
yearweekList = [202001, 202002, 202003, 202004, 202005]
qtyList = [10, 15, 20, 13, 22]

In [12]:
# 각각 데이터 프레임 생성
yearweekDf = pd.DataFrame(yearweekList)
qtyDf = pd.DataFrame(qtyList)

In [13]:
# yearweekDf와 qtyDf를 엮겠다 
# axis = 1 (x축, 좌우) / axis = 0 (y축, 상하)
pd.concat([yearweekDf, qtyDf], axis = 1)

        0   0
0  202001  10
1  202002  15
2  202003  20
3  202004  13
4  202005  22

In [14]:
# 이름 붙여주고, 컬럼명 생성
mergedDf = pd.concat([yearweekDf, qtyDf], axis = 1)
mergedDf.columns = ["yearweek", "qty"]

In [15]:
mergedDf

   yearweek  qty
0    202001   10
1    202002   15
2    202003   20
3    202004   13
4    202005   22

### Row 단위 병합

In [ ]:
# 크롤링 할 때 위에서 아래로 하나씩 담을 수도 있지만,
# 하나의 행씩 담는 것도 가능하다

In [16]:
firstRow = [202001, 10]
secondRow = [202002, 15]

In [17]:
# 각각의 리스트를 한 리스트에 넣고
# DataFrame으로 캐스팅을 해주면, 하나의 행씩 만들 수 있다 
totalRow = pd.DataFrame (  [ firstRow, secondRow ] )
totalRow

        0   1
0  202001  10
1  202002  15

### 딕셔너리를 활용한 데이터프레임 생성

In [ ]:
# 딕셔너리의 key가 column, value가 값을 의미한다고 생각

In [18]:
testDict = { "yearweek" : [202001, 202002, 202003],
             "qty" : [10, 15, 20] }

In [19]:
pd.DataFrame(testDict)

   yearweek  qty
0    202001   10
1    202002   15
2    202003   20

In [20]:
testDf = pd.DataFrame(testDict)
testDf

   yearweek  qty
0    202001   10
1    202002   15
2    202003   20

### .to_csv()

In [21]:
testDf = pd.DataFrame(testDict)
testDf

   yearweek  qty
0    202001   10
1    202002   15
2    202003   20

In [22]:
# 현재 폴더에 testdf.csv로 저장해라
# index = False를 붙여주면 깔끔하게 값만 추출할 수 있다
testDf.to_csv("./testdf.csv", index = False)

### 컬럼명 변경 시 rename 활용

In [23]:
testDict = { "yearweek" : [202001, 202002, 202003],
             "qty" : [10, 15, 20] }

In [24]:
testDf = pd.DataFrame(testDict)
testDf

   yearweek  qty
0    202001   10
1    202002   15
2    202003   20

In [25]:
testDf.rename(columns = { "yearweek" : "yw",
                        "qty" : "volume" } )

       yw  volume
0  202001      10
1  202002      15
2  202003      20